Strogino/src/InformationRegisters/СинхронизируемыеСправочники/СинхронизируемыеСправочники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинхронизируемыеСправочники</name>
  <resources>
    <name>Включить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьЧасто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Обмен_ОписаниеОбъектов77</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Strogino/src/InformationRegisters/СинхронизируемыеСправочники/ManagerModule.bsl
Процедура ЗаполнитьРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинхронизируемыеСправочники.Объект,
	|	СинхронизируемыеСправочники.Включить
	|ИЗ
	|	РегистрСведений.СинхронизируемыеСправочники КАК СинхронизируемыеСправочники";
	ТекущиеНастройки = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.СинхронизируемыеСправочники.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Обмен_ОписаниеОбъектов77.Ссылка как Объект,
	|	Обмен_ОписаниеОбъектов77.ИмяМетаданного
	|ИЗ
	|	Справочник.Обмен_ОписаниеОбъектов77 КАК Обмен_ОписаниеОбъектов77
	|ГДЕ
	|	Обмен_ОписаниеОбъектов77.ТипМетаданного = ""Справочник""
	|	И НЕ Обмен_ОписаниеОбъектов77.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		Если Метаданные.Справочники.Найти(Выборка.ИмяМетаданного) <> Неопределено тогда
			Запись = НаборЗаписей.Добавить();	
			Запись.Объект = Выборка.Объект;
			НастройкиДо = ТекущиеНастройки.Найти(Выборка.Объект,"Объект");
			Если НастройкиДо <> неопределено тогда
				Запись.Включить = НастройкиДо.Включить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
